In [1]:
import pandas as pd
import numpy as np

# empty list creaion

In [9]:
#create an empty seriress
s=pd.Series
print(s)

<class 'pandas.core.series.Series'>

In [10]:
print(type(s))

<class 'type'>

# pandas.series

In [11]:
data=np.array(['a','b','c','d'])
print(data)

['a' 'b' 'c' 'd']

In [12]:
#series from nd array
s=pd.Series(data)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [13]:
#series from nd array with indexing parameter 
s=pd.Series(data, index=[100,101,102,103])        
print(s)

100    a
101    b
102    c
103    d
dtype: object

## series from a dictionary

In [14]:
data={'a':0, 'b':1,'c':2}
print(data)

{'a': 0, 'b': 1, 'c': 2}

In [15]:
s=pd.Series(data)
print(s)

a    0
b    1
c    2
dtype: int64

In [16]:
#series from dictionary with index parameter
s=pd.Series(data,index={'b','c','d','a'})
print(s)

b    1.0
d    NaN
a    0.0
c    2.0
dtype: float64

In [17]:
#creation f a series with scalar value or  constant
s=pd.Series(5,index=[0,1,2,3])
print(s)

0    5
1    5
2    5
3    5
dtype: int64

# accesing data from series with position

In [18]:
s=pd.Series([1,2,3,4,5], index={'a','b','c','d','e'})
print(s)

c    1
a    2
e    3
b    4
d    5
dtype: int64

In [19]:
#retrieve first elemnt
print(s[0])

1

In [20]:
#retive the dirst three elements 
print(s[-3:])

e    3
b    4
d    5
dtype: int64

### retrieving using label(index)

In [21]:
#retrieving using single element 
print(s['a'])

2

In [22]:
#retrieve multiple elements
print(s[['a','b','c']])

a    2
b    4
c    1
dtype: int64

In [23]:
#retrieve non existant index
print(s['c'])

1

# data operations

# axex

In [23]:
#create a series with rndom no.s 
s=pd.Series(np.random.randn(8))
print(s)

0    1.148230
1    0.429502
2   -0.477637
3   -0.381534
4    0.742244
5    0.592822
6   -1.524776
7    0.385444
dtype: float64

In [24]:
print( "the axes are : " )
print(s.axes)

the axes are :
[RangeIndex(start=0, stop=8, step=1)]

In [26]:
s2=pd.Series(np.random.randn(4),index=[11,12,13,14])
print(s2)

11    0.193365
12    0.020615
13    0.366702
14    0.535875
dtype: float64

In [27]:
print("the axes are ")
print(s2.axes)

the axes are
[Int64Index([11, 12, 13, 14], dtype='int64')]

## dtype

In [28]:
print(s.dtype)

float64

# ndim

In [29]:
print("the dimensions of the object are :")
s.ndim

the dimensions of the object are :

1

## size

In [30]:
print("the size of the object : ")
s.size

the size of the object :

8

## empty

In [31]:
se=pd.Series()
print(se)

Series([], dtype: float64)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [32]:
print("is the object empty ?? ")
s.empty

is the object empty ??

False

## values

In [35]:
print("the actual data series is :")
s.values

the actual data series is :

array([ 1.14823014,  0.42950235, -0.47763739, -0.38153385,  0.7422444 ,
        0.59282207, -1.52477625,  0.38544408])

## head

In [37]:
print("the first two elemnts of the list arre")
s.head(2)

the first two elemnts of the list arre

0    1.148230
1    0.429502
dtype: float64

## tail

In [39]:
print("the last two aelements of the l;ist are ")
s.tail(2)

the last two aelements of the l;ist are

6   -1.524776
7    0.385444
dtype: float64

# DataFrame

## creatig an empty data frame

In [40]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

## data frame from list

In [41]:
data =[11,12,13,14,15]
df=pd.DataFrame(data)
df

    0
0  11
1  12
2  13
3  14
4  15

In [25]:
data=[['alok',10],['bhushan',12],['chitra',13]]
pf=pd.DataFrame(data,columns=["Name","age"])
pf

      Name  age
0     alok   10
1  bhushan   12
2   chitra   13

In [45]:
df=pd.DataFrame(data , columns=["Name","Age"],dtype=float)
print(df)

      Name   Age
0     alok  10.0
1  bhushan  12.0
2   chitra  13.0

## DataFramae from a dictionary

In [46]:
data =[11,12,13,14,15]
df=pd.DataFrame(data)
df

    0
0  11
1  12
2  13
3  14
4  15

In [47]:
data=[["alok",10],["bhushan",12],["chitra",13]]

In [49]:
pf=pd.DataFrame(data,columns=["Name","Age"],dtype=float)
pf

      Name   Age
0     alok  10.0
1  bhushan  12.0
2   chitra  13.0

# dataframe from list of dicks

In [51]:
data=[{"a":1,"b":2},{'a':5,"b":10,"c":20}]
data

[{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]

In [52]:
df=pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [53]:
df=pd.DataFrame(data,index=["first","second"])
df

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [54]:
df1=pd.DataFrame(data,index=["first","second"],columns=["a","b"])
df1

        a   b
first   1   2
second  5  10

In [56]:
df2=pd.DataFrame(data,index=["first","second"],columns=["a","b1"])
df2

        a  b1
first   1 NaN
second  5 NaN

In [23]:
import pandas as pd
import numpy as np

In [24]:
d={"one":pd.Series([1,2,3],index=["a","b","c"]),"two":pd.Series([1,2,3,4],index=['a','b','c','d'])}

In [25]:
df=pd.DataFrame(d)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

# column selection

In [26]:
print(df["one"])

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

# column addition

In [27]:
#adding a new column by passing as Series
df["three"]=pd.Series([10,20,30],index=['a','b','c'])
print(df)

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [28]:
#adding a new column using the extension columns in hte dataframe
df["four"]=df["one"]+df["three"]
df

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

# Deletion

In [29]:
#using del function
del df["one"]
print(df)

   two  three  four
a    1   10.0  11.0
b    2   20.0  22.0
c    3   30.0  33.0
d    4    NaN   NaN

In [30]:
#using pop functon
x=df.pop("two")
print(x)

a    1
b    2
c    3
d    4
Name: two, dtype: int64

In [31]:
print(df)

   three  four
a   10.0  11.0
b   20.0  22.0
c   30.0  33.0
d    NaN   NaN

# row selection

In [32]:
#selection by label
print(df.loc['b'])

three    20.0
four     22.0
Name: b, dtype: float64

In [33]:
#selectio by integer location 
print(df.iloc[2])

three    30.0
four     33.0
Name: c, dtype: float64

In [34]:
#slice rows
print(df[2:4])

   three  four
c   30.0  33.0
d    NaN   NaN

## adddition of rows

In [36]:
pf=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df

   three  four
a   10.0  11.0
b   20.0  22.0
c   30.0  33.0
d    NaN   NaN

In [37]:
df2=pd.DataFrame([[5,6],[7,8]],columns=["a","b"])
df2

   a  b
0  5  6
1  7  8

In [38]:
df3=df.append(df2)
df3

   three  four    a    b
a   10.0  11.0  NaN  NaN
b   20.0  22.0  NaN  NaN
c   30.0  33.0  NaN  NaN
d    NaN   NaN  NaN  NaN
0    NaN   NaN  5.0  6.0
1    NaN   NaN  7.0  8.0

In [39]:
df4=df.append(df2,ignore_index=True)
df4

   three  four    a    b
0   10.0  11.0  NaN  NaN
1   20.0  22.0  NaN  NaN
2   30.0  33.0  NaN  NaN
3    NaN   NaN  NaN  NaN
4    NaN   NaN  5.0  6.0
5    NaN   NaN  7.0  8.0

# deletion of rows

In [43]:
df=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df

   a  b
0  1  2
1  3  4

In [44]:
#drops rowss with label 0 
df=df.drop(0)
df

   a  b
1  3  4

# DataOperations

In [45]:
d={'Name':pd.Series(["Parnay","Swapnil","aayushi","Viraj","Bhushan","Ashwin","Vishal"]),"Age":pd.Series([25,26,25,23,30,29,23]),"Rating":pd.Series([4,2,3,324,3,98,2,56,3,20,4.6,8])}

In [46]:
df=pd.DataFrame(d,columns=["Name","Age","Rating"])
df

       Name   Age  Rating
0    Parnay  25.0     4.0
1   Swapnil  26.0     2.0
2   aayushi  25.0     3.0
3     Viraj  23.0   324.0
4   Bhushan  30.0     3.0
5    Ashwin  29.0    98.0
6    Vishal  23.0     2.0
7       NaN   NaN    56.0
8       NaN   NaN     3.0
9       NaN   NaN    20.0
10      NaN   NaN     4.6
11      NaN   NaN     8.0

In [49]:
#T(Traspose)
print(df.T)

             0        1        2      3        4       5       6    7    8  \
Name    Parnay  Swapnil  aayushi  Viraj  Bhushan  Ashwin  Vishal  NaN  NaN
Age         25       26       25     23       30      29      23  NaN  NaN
Rating       4        2        3    324        3      98       2   56    3

          9   10   11
Name    NaN  NaN  NaN
Age     NaN  NaN  NaN
Rating   20  4.6    8

In [53]:
#axes(Row axis albels and column axis albles)
print(df.axes)

[RangeIndex(start=0, stop=12, step=1), Index(['Name', 'Age', 'Rating'], dtype='object')]

In [55]:
#dtype
print(df.dtypes)

Name       object
Age       float64
Rating    float64
dtype: object

In [56]:
#size
print(df.size)

36

In [57]:
#ndim
print(df.ndim)

2

In [58]:
#shape
print(df.shape)

(12, 3)

In [59]:
#vlaues
print(df.values)

[['Parnay' 25.0 4.0]
 ['Swapnil' 26.0 2.0]
 ['aayushi' 25.0 3.0]
 ['Viraj' 23.0 324.0]
 ['Bhushan' 30.0 3.0]
 ['Ashwin' 29.0 98.0]
 ['Vishal' 23.0 2.0]
 [nan nan 56.0]
 [nan nan 3.0]
 [nan nan 20.0]
 [nan nan 4.6]
 [nan nan 8.0]]

In [60]:
#head
print(df.head(2))

      Name   Age  Rating
0   Parnay  25.0     4.0
1  Swapnil  26.0     2.0

In [61]:
#tail
print(df.head(2))

      Name   Age  Rating
0   Parnay  25.0     4.0
1  Swapnil  26.0     2.0

# Reindexing

In [66]:
obj=pd.Series([4.5,7.2,-5.3,3.6],index=["d","b","a","c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [68]:
obj2=obj.reindex(["a","b","c","d","e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [69]:
obj3=pd.Series(["blue","purple","yellow"],index=[0,2,4])
print(obj3)

0      blue
2    purple
4    yellow
dtype: object

In [70]:
obj3.reindex(range(6),method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

# reindexing n dataFrame

In [76]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)),index=["a","c","d"],columns=["nagpur","raipur","hyderabad"])
print(frame)

   nagpur  raipur  hyderabad
a       0       1          2
c       3       4          5
d       6       7          8

In [80]:
frame2=frame.reindex(["a","b","c","d"])
frame2

   nagpur  raipur  hyderabad
a     0.0     1.0        2.0
b     NaN     NaN        NaN
c     3.0     4.0        5.0
d     6.0     7.0        8.0

In [82]:
states=["raipur","indore","hyderabad"]
frame.reindex(columns=states)

   raipur  indore  hyderabad
a       1     NaN          2
c       4     NaN          5
d       7     NaN          8

In [83]:
frame

   nagpur  raipur  hyderabad
a       0       1          2
c       3       4          5
d       6       7          8

In [84]:
frame.reindex(index=["a","b","c","d"],columns=states)

   raipur  indore  hyderabad
a     1.0     NaN        2.0
b     NaN     NaN        NaN
c     4.0     NaN        5.0
d     7.0     NaN        8.0

In [86]:
obj=pd.Series(np.arange(5),index=["a","b","c","d","e"])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [87]:
new_obj=obj.drop("c")
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [88]:
obj.drop(["d","c"])

a    0
b    1
e    4
dtype: int32

In [91]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=["nagpur","raipur","hyderabad","indore"],columns=["one","two","three","four"])
data

           one  two  three  four
nagpur       0    1      2     3
raipur       4    5      6     7
hyderabad    8    9     10    11
indore      12   13     14    15

In [92]:
data.drop(["raipur","nagpur"])

           one  two  three  four
hyderabad    8    9     10    11
indore      12   13     14    15

In [96]:
data.drop("two",axis=1)

           one  three  four
nagpur       0      2     3
raipur       4      6     7
hyderabad    8     10    11
indore      12     14    15

In [98]:
data.drop(["two","four"],axis="columns")

           one  three
nagpur       0      2
raipur       4      6
hyderabad    8     10
indore      12     14

# arithmetic and data aliignment

In [99]:
s1=pd.Series([7.3,2.5,3.4,1.5],index=['a',"c","d","e"])
s1

a    7.3
c    2.5
d    3.4
e    1.5
dtype: float64

In [100]:
s2=pd.Series([-2.1,3.6,-1.5,4,3.1],index=["a","c","e","f","g"])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [101]:
s1+s2

a    5.2
c    6.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [102]:
df1=pd.DataFrame(np.arange(9).reshape(3,3),columns=list("bcd"),index=["nagpur","raipur","hyderabad"])
df1

           b  c  d
nagpur     0  1  2
raipur     3  4  5
hyderabad  6  7  8

In [104]:
df2=pd.DataFrame(np.arange(12).reshape(4,3),columns=list("bde"),index=["indore","nagpur","raipur","hyderabad"])
df2

           b   d   e
indore     0   1   2
nagpur     3   4   5
raipur     6   7   8
hyderabad  9  10  11

In [105]:
df1+df2

              b   c     d   e
hyderabad  15.0 NaN  18.0 NaN
indore      NaN NaN   NaN NaN
nagpur      3.0 NaN   6.0 NaN
raipur      9.0 NaN  12.0 NaN

In [106]:
df1=pd.DataFrame(np.arange(12).reshape(3,4),columns=list("abcd"))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [110]:
df2=pd.DataFrame(np.arange(20).reshape(4,5),columns=list("abcde"))
df2.loc[1,"b"]=np.nan
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [111]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [113]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [4]:
frame=pd.DataFrame(np.arange(12).reshape(4,3),columns=list("bde"),index=["raipur","nagpur","hyderabad","indore"])
frame

           b   d   e
raipur     0   1   2
nagpur     3   4   5
hyderabad  6   7   8
indore     9  10  11

In [116]:
series=frame.iloc[0]
series

b    0
d    1
e    2
Name: raipur, dtype: int32

In [117]:
frame-series

           b  d  e
raipur     0  0  0
nagpur     3  3  3
hyderabad  6  6  6
indore     9  9  9

In [118]:
series2=pd.Series(range(3),index=["b","e","f"])
series2

b    0
e    1
f    2
dtype: int64

In [119]:
frame+series2

             b   d     e   f
raipur     0.0 NaN   3.0 NaN
nagpur     3.0 NaN   6.0 NaN
hyderabad  6.0 NaN   9.0 NaN
indore     9.0 NaN  12.0 NaN

In [121]:
series3=frame["d"]
series3

raipur        1
nagpur        4
hyderabad     7
indore       10
Name: d, dtype: int32

In [2]:
series2=pd.Series(range(3),index=['b','e','f'])
series2

b    0
e    1
f    2
dtype: int64

In [5]:
frame

           b   d   e
raipur     0   1   2
nagpur     3   4   5
hyderabad  6   7   8
indore     9  10  11

In [6]:
frame+series2

             b   d     e   f
raipur     0.0 NaN   3.0 NaN
nagpur     3.0 NaN   6.0 NaN
hyderabad  6.0 NaN   9.0 NaN
indore     9.0 NaN  12.0 NaN

In [9]:
series3=frame["d"]
series3

raipur        1
nagpur        4
hyderabad     7
indore       10
Name: d, dtype: int32

In [10]:
frame

           b   d   e
raipur     0   1   2
nagpur     3   4   5
hyderabad  6   7   8
indore     9  10  11

In [11]:
frame.sub(series3,axis="index")

           b  d  e
raipur    -1  0  1
nagpur    -1  0  1
hyderabad -1  0  1
indore    -1  0  1

# Function applications and mapping

In [12]:
frame=pd.DataFrame(np.random.randn(4,3),columns=list("bde"),index=["raipur","nagpur","hyderabad","indore"])
frame

                  b         d         e
raipur    -0.637651  0.534292 -0.238083
nagpur    -0.578776  0.080473  0.564932
hyderabad -0.220953  1.390696 -0.397736
indore     0.427911 -0.972408  0.762520

In [13]:
np.abs(frame)

                  b         d         e
raipur     0.637651  0.534292  0.238083
nagpur     0.578776  0.080473  0.564932
hyderabad  0.220953  1.390696  0.397736
indore     0.427911  0.972408  0.762520

In [14]:
f=lambda x : x.max()-x.min()
frame.apply(f)

b    1.065562
d    2.363104
e    1.160256
dtype: float64

In [15]:
frame.apply(f,axis="columns")

raipur       1.171944
nagpur       1.143708
hyderabad    1.788432
indore       1.734928
dtype: float64

In [16]:
def f(x):
    return pd.Series([x.min(),x.max()],index=["min","max"])
frame.apply(f)

            b         d         e
min -0.637651 -0.972408 -0.397736
max  0.427911  1.390696  0.762520

# Sorting and ranking

In [17]:
obj=pd.Series(range(4),index=["d","a","b","c"])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [18]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [19]:
frame=pd.DataFrame(np.arange(8).reshape((2,4)),index=["three","one"],columns=["d","a","b","c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [20]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [21]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [22]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [23]:
obj=pd.Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [24]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [25]:
obj=pd.Series([4,np.nan,7,np.nan,-3,2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [26]:
frame=pd.DataFrame({"b":[4,7,-3,2],"a":[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [27]:
frame.sort_values(by="b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [28]:
frame.sort_values(by=["a","b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [29]:
obj=pd.Series([7,-5,7,4,2,0,4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [31]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [32]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [33]:
#asign tie values the maximum rank in the group
obj.rank(ascending=False,method="max")

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [34]:
frame=pd.DataFrame({"b":[4.3,7,-3,2],"a":[0,1,0,1],"c":[-2,5,8,-2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [36]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [37]:
obj=pd.Series(range(5),index=["a","a","b","b","c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [38]:
obj.index.is_unique

False

In [39]:
obj["a"]

a    0
a    1
dtype: int64

In [40]:
obj["c"]

4

In [41]:
df=pd.DataFrame(np.random.randn(4,3),index=["a","a","b","c"])
df

          0         1         2
a -0.774768  0.512848  0.142788
a -0.050078  0.063995 -0.591137
b  0.444476 -0.086481  1.867641
c  0.932659  0.591447  0.755339

In [42]:
df.loc["b"]

0    0.444476
1   -0.086481
2    1.867641
Name: b, dtype: float64

In [43]:
df.loc["a"]

          0         1         2
a -0.774768  0.512848  0.142788
a -0.050078  0.063995 -0.591137

In [47]:
df=pd.DataFrame([[1.4,np.nan],[7.1,4.5],[np.nan,np.nan],[0.75,-1.3]],index=["a","b","c","d"],columns=["one","two"])
df

    one  two
a  1.40  NaN
b  7.10  4.5
c   NaN  NaN
d  0.75 -1.3

In [48]:
df.sum()

one    9.25
two    3.20
dtype: float64

# descriptive analysisi with pandas

In [49]:
df.sum(axis="columns")

a     1.40
b    11.60
c     0.00
d    -0.55
dtype: float64

In [50]:
df.mean(axis="columns",skipna=False)

a      NaN
b    5.800
c      NaN
d   -0.275
dtype: float64

In [51]:
df.cumsum

<bound method DataFrame.cumsum of     one  two
a  1.40  NaN
b  7.10  4.5
c   NaN  NaN
d  0.75 -1.3>

In [52]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333  1.600000
std    3.493685  4.101219
min    0.750000 -1.300000
25%    1.075000  0.150000
50%    1.400000  1.600000
75%    4.250000  3.050000
max    7.100000  4.500000

In [55]:
obj=pd.Series(["a","a","b","c"]*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [56]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [58]:
obj=pd.Series(["c","a","d","a","a","b","b","c","c"])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [59]:
uniques=obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [61]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

#  unique valuesvalue counts,membership

In [62]:
mask=obj.isin(["b","c"])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [63]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [65]:
pd.value_counts(obj.values,sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [69]:
df=pd.read_csv("temp.txt")
df

   S.No    Name   Age       City  Salary
0     1  Vishal   NaN     Nagpur   20000
1     2  Pranay  32.0     Mumbai    3000
2     3  Akshay  43.0   Banglore    8300
3     4     Ram  38.0  Hyderabad    3900

In [70]:
print(df.shape)

(4, 5)

In [71]:
df=pd.read_csv("temp.txt",usecols=["Name","Age"])
df

     Name   Age
0  Vishal   NaN
1  Pranay  32.0
2  Akshay  43.0
3     Ram  38.0

In [ ]:
##----------custom indedx---
df=pd.read_csv("temp.txt",index_col=["S.No"])
df

In [ ]:
df.shape

In [ ]:
df.dtypes

# reading data from Json

In [3]:
data=pd.read_json("example.json")
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
data.to_json()

'{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}'

In [5]:
data.to_json(orient="records")

'[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]'

# HTML

In [6]:
tables=pd.read_html("fdic_failed_bank_list.html")
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [7]:
failures=tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [9]:
close_timestamps=pd.to_datetime(failures["Closing Date"])
close_timestamps.dt.year.value_counts

<bound method IndexOpsMixin.value_counts of 0      2016
1      2016
2      2016
3      2016
4      2016
       ...
542    2001
543    2001
544    2001
545    2000
546    2000
Name: Closing Date, Length: 547, dtype: int64>

# Excel

In [11]:
frame=pd.read_excel("ex1.xlsx","Sheet1")
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [13]:
frame.to_excel("ex2.xlsx")

# web API

In [20]:
import requests
url= 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp=requests.get(url)
resp

In [21]:
data=resp.json()
data[0]["title"]

'BUG: pd.Series/DataFrame.truncate() drops multiindex names'

In [23]:
issues=pd.DataFrame(data,columns=["numbers","title","lables","state"])
issues

    numbers                                              title  lables state
0       NaN  BUG: pd.Series/DataFrame.truncate() drops mult...     NaN  open
1       NaN            CLN: circular/runtime imports in tslibs     NaN  open
2       NaN            ENH: more functions like between_time()     NaN  open
3       NaN  DOC: Fixed PR06 (wrong parameter type) in pand...     NaN  open
4       NaN             DOC: Add bcpandas to Ecosystem in docs     NaN  open
5       NaN           BUG: DataFrame size overflows on Windows     NaN  open
6       NaN  ENH: Rolling Calculations Ignore Extended Wind...     NaN  open
7       NaN  BUG: DataFrame.drop_duplicates confuses NULL b...     NaN  open
8       NaN    BUG: Series.unique segfaults on invalid unicode     NaN  open
9       NaN                         Ci #34131 rm slow fixtures     NaN  open
10      NaN  Chunksize from json memory consumption as high...     NaN  open
11      NaN  reindex_like(s, method='ffill') is different t...     NaN  open
12      NaN  BUG: to_datetime do not keep the date format t...     NaN  open
13      NaN  DEPR: Deprecate tshift and integrated it to shift     NaN  open
14      NaN      DOC: DatetimeIndex day says the same as month     NaN  open
15      NaN     ENH: Allow join based on conditional statement     NaN  open
16      NaN  DOC: documentation link to whatsnew v1.0.4 not...     NaN  open
17      NaN  BUG: Index slice an all-zero float sparse seri...     NaN  open
18      NaN  CI/TST #34131 fixed test_floordiv_axis0_numexp...     NaN  open
19      NaN  BUG: where(...) unexpectedly casts None to np....     NaN  open
20      NaN  Pickle incompatibility between 0.25 and 1.0 wh...     NaN  open
21      NaN  BUG: pd.Series produces NaN for valid input as...     NaN  open
22      NaN  BUG: Groupby sum, different result between 0.2...     NaN  open
23      NaN  Extreme performance issue in pandas 1.0.3 when...     NaN  open
24      NaN  BUG: series with dtype "Int64" don't work corr...     NaN  open
25      NaN                  apply() fails on some value types     NaN  open
26      NaN             ENH: Implement categorical correlation     NaN  open
27      NaN       Getting Attribute error while merging framed     NaN  open
28      NaN  BUG: Select an all-zero sparse series by index...     NaN  open
29      NaN  BUG: Mixed DataFrame with Extension Array inco...     NaN  open

# sql reading

In [30]:
import sqlite3
conn=sqlite3.connect("employee_db")

In [32]:
df=pd.read_sql("select * from emp;",conn)
df.head()

DatabaseError: Execution failed on sql 'select * from emp;': no such table: emp

# SQL Data Base File Reading

In [29]:
df=pd.read_sql('''SELECT e.ename,e.job,e.deptno,d.name FROM emp as e INNER JOIN dept as d  ON d.deptno=e.deptno;''',conn)
df.head

DatabaseError: Execution failed on sql 'SELECT e.ename,e.job,e.deptno,d.name FROM emp as e INNER JOIN dept as d  ON d.deptno=e.deptno;': no such table: emp